<script setup lang="ts"></script>
<template>
  <p class="description">
    ▎Основные правила: <br />
    1. Игровое поле: Представляет собой сетку клеток, каждая из которых может быть либо живой (заполненной), либо
    мёртвой (пустой). <br />
    2. Состояния клеток: - Живая клетка: Клетка, которая содержит «жизнь». - Мёртвая клетка: Клетка, которая не содержит
    «жизни». <br />
    3. Правила эволюции: - Рождение: Мёртвая клетка с ровно тремя живыми соседями становится живой. - Выживание: Живая
    клетка с двумя или тремя живыми соседями остаётся живой. - Смерть: Живая клетка с менее чем двумя или более чем
    тремя живыми соседями умирает. <br />
    4. Соседи: Каждая клетка имеет восемь соседей (горизонтальные, вертикальные и диагональные клетки). <br />
    ▎Процесс игры: <br />
    1. Начинается с начального состояния клеток (можно задать вручную или случайным образом). <br />
    2. Применяются правила к каждой клетке, чтобы определить её состояние в следующем поколении. <br />
    3. Переходите к следующему поколению и повторяйте процесс. <br />
    ▎Цель игры: <br />
    Игра не имеет конкретной цели, но наблюдение за эволюцией клеток может быть увлекательным и познавательным.
    Некоторые конфигурации могут стабилизироваться, бесконечно колебаться или приводить к росту новых структур. Это
    основа игры! Если нужны дополнительные детали или примеры конфигураций, дайте знать!
  </p>
</template>
<style scoped lang="scss">
.description {
  font-size: 16px;
  font-weight: 500;
  line-height: 36px;
}
</style>
